dataset_gen/Earlier_Datasets/Hole_Size_Change/CE_KH_Openfoam/Design_Point_0_copy_2/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15708
(
(0.00390625 0.00390625 0.05)
(0.0117188 0.00390625 0.05)
(0.0195313 0.00390625 0.05)
(0.0273438 0.00390625 0.05)
(0.0351563 0.00390625 0.05)
(0.0429688 0.00390625 0.05)
(0.0507813 0.00390625 0.05)
(0.0585938 0.00390625 0.05)
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    hole
    {
        type            calculated;
        value           nonuniform List<vector> 
104
(
(0.402344 0.398438 0.05)
(0.410157 0.398438 0.05)
(0.417969 0.398438 0.05)
(0.425782 0.398438 0.05)
(0.433594 0.398438 0.05)
(0.441407 0.398438 0.05)
(0.449219 0.398438 0.05)
(0.457031 0.398438 0.05)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
