dataset_gen/Earlier_Datasets/Hole_Size_Change/CE_KH_Openfoam/Design_Point_0_copy_2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  8
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   nonuniform List<vector>
15708
(
    (0.500000 0.000000 0.000000)
    (0.500000 0.000000 0.000000)
    (0.500000 0.000000 0.000000)
    (0.500000 0.000000 0.000000)
    (0.500000 0.000000 0.000000)
    (0.500000 0.000000 0.000000)
    (0.500000 0.000000 0.000000)
    (0.500000 0.000000 0.000000)
...
);

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    hole
    {
        type            fixedValue;
        value uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}
